SSE.initSnappableTagCache
for non const methods

SSE.getPickEntityType(Element!System.Runtime.CompilerServices.IsConst*,Pick!System.Runtime.CompilerServices.IsConst*)
returns the EntityType of picked lines.

SSE.getEntityInfo(System.Int32,XYZUtils.XYZ*,System.Double*,System.Boolean*,System.Boolean*)
- edge offset is the average of offsets of its ends
- for edges "pOffsetsEqual" reports whether ends have the same offset. always true for vertices